"""
테스트에 사용될 공통 코스 인터벌(Course Interval) 데이터
"""

POINTS_A_TO_B_DATA = [ # PLACE_A -> PLACE_B
    {"lat": 37.44713775, "lon": 126.94967528, "ele": 234},
    {"lat": 37.44712866, "lon": 126.94966790, "ele": 233},
    {"lat": 37.44706458, "lon": 126.94957361, "ele": 230},
    {"lat": 37.44698470, "lon": 126.94950529, "ele": 229},
]

POINTS_B_TO_C_DATA = [ # PLACE_B -> PLACE_C
    {"lat": 37.44698470, "lon": 126.94950529, "ele": 229},
    {"lat": 37.44694413, "lon": 126.94961468, "ele": 230},
    {"lat": 37.44691773, "lon": 126.94973429, "ele": 228},
    {"lat": 37.44692008, "lon": 126.94986354, "ele": 230},
]
